anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
#include "BoardBlePassiveScanner.h"

#include <algorithm>
#include <array>
#include <atomic>
#include <cstdio>
#include <cstring>

#include <esp_err.h>
#include <esp32-hal-alloc-ble-mem.h>
#include <esp_heap_caps.h>
#include <esp_timer.h>
#include <freertos/FreeRTOS.h>
#include <freertos/portmacro.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <host/ble_gap.h>
#include <host/ble_gatt.h>
#include <host/ble_hs.h>
#include <host/ble_hs_id.h>
#include <host/ble_uuid.h>
#include <host/util/util.h>
#include <nimble/nimble_port.h>
#include <nimble/nimble_port_freertos.h>

namespace leshy1::platform::arduino {

namespace {

using AdvertisementFacts =
    domain::observations::BleAdvertisementFacts;

constexpr std::uint32_t kNimbleSyncTimeoutMs = 5000U;

struct RawAdvertisement final {
    std::array<std::uint8_t, 6> address{};
    std::array<std::uint8_t, 31> payload{};
    std::uint8_t addressType = 0;
    std::uint8_t eventType = 0;
    std::uint8_t payloadLength = 0;
    std::int8_t rssiDbm = 0;
};

struct NimbleObserverState final {
    static constexpr std::size_t kQueueCapacity = 64U;

    portMUX_TYPE lock = portMUX_INITIALIZER_UNLOCKED;
    std::array<RawAdvertisement, kQueueCapacity> queue{};
    std::size_t readIndex = 0;
    std::size_t writeIndex = 0;
    std::size_t queued = 0;
    std::uint16_t reportsObserved = 0;
    std::uint16_t queueDrops = 0;
    bool acceptingReports = false;
};

NimbleObserverState nimbleObserver;
StaticSemaphore_t gattInspectorMutexStorage{};
SemaphoreHandle_t gattInspectorMutex =
    xSemaphoreCreateRecursiveMutexStatic(&gattInspectorMutexStorage);

class GattInspectorLock final {
public:
    GattInspectorLock() {
        configASSERT(gattInspectorMutex != nullptr);
        locked_ = xSemaphoreTakeRecursive(
            gattInspectorMutex, portMAX_DELAY) == pdTRUE;
        configASSERT(locked_);
    }

    ~GattInspectorLock() {
        if (locked_) {
            (void)xSemaphoreGiveRecursive(gattInspectorMutex);
        }
    }

    GattInspectorLock(const GattInspectorLock&) = delete;
    GattInspectorLock& operator=(const GattInspectorLock&) = delete;

private:
    bool locked_ = false;
};
bool processControllerInitialized = false;
std::atomic_bool processControllerAvailable{false};
std::atomic_bool processNimbleSynced{false};
std::atomic_bool processNimbleHostRunning{false};
std::atomic<std::uint8_t> processOwnAddressType{BLE_OWN_ADDR_PUBLIC};
std::atomic_int processNimbleSyncError{0};

struct RawScanContext final {
    std::array<std::array<std::uint8_t, 6>, 128> seenAddresses{};
    std::uint16_t seenCount = 0;
    std::uint16_t maximumRecords = 0;
    bool deduplicateAddresses = true;
    BleRecordVisitor visitor = nullptr;
    void* visitorContext = nullptr;
    BoardBlePassiveScanResult* result = nullptr;
};

struct UuidCandidates final {
    const std::uint8_t* uuid16 = nullptr;
    const std::uint8_t* uuid32 = nullptr;
    const std::uint8_t* uuid128 = nullptr;
    const std::uint8_t* service16 = nullptr;
    const std::uint8_t* service32 = nullptr;
    const std::uint8_t* service128 = nullptr;
};

void increment(std::uint16_t* value) {
    if (value != nullptr && *value != UINT16_MAX) ++*value;
}

std::uint8_t saturatingAdd(std::uint8_t value, std::size_t amount) {
    return static_cast<std::uint8_t>(std::min<std::size_t>(
        static_cast<std::size_t>(value) + amount, UINT8_MAX));
}

std::uint16_t serviceMask(std::uint16_t uuid) {
    struct Known final {
        std::uint16_t uuid;
        std::uint16_t mask;
    };
    static constexpr Known kKnown[] = {
        {0x1812, AdvertisementFacts::kServiceHid},
        {0x180f, AdvertisementFacts::kServiceBattery},
        {0x180d, AdvertisementFacts::kServiceHeartRate},
        {0x1809, AdvertisementFacts::kServiceThermometer},
        {0x1826, AdvertisementFacts::kServiceFitness},
        {0xfeaa, AdvertisementFacts::kServiceEddystone},
        {0xfe95, AdvertisementFacts::kServiceXiaomi},
        {0xfd5a, AdvertisementFacts::kServiceSmartTag},
        {0xfeed, AdvertisementFacts::kServiceTile},
        {0xfe9f, AdvertisementFacts::kServiceFastPair},
        {0xfd6f, AdvertisementFacts::kServiceExposure},
    };
    for (const Known& known : kKnown) {
        if (known.uuid == uuid) return known.mask;
    }
    return 0U;
}

std::uint16_t readLittleEndian16(const std::uint8_t* value) {
    return static_cast<std::uint16_t>(value[0]) |
        (static_cast<std::uint16_t>(value[1]) << 8U);
}

std::uint32_t readLittleEndian32(const std::uint8_t* value) {
    return static_cast<std::uint32_t>(value[0]) |
        (static_cast<std::uint32_t>(value[1]) << 8U) |
        (static_cast<std::uint32_t>(value[2]) << 16U) |
        (static_cast<std::uint32_t>(value[3]) << 24U);
}

void retainFirstServiceUuid(const std::uint8_t* value,
                            std::size_t width,
                            AdvertisementFacts* facts) {
    if (value == nullptr || facts == nullptr) return;
    char uuid[37] = {};
    if (width == 2U) {
        std::snprintf(uuid, sizeof(uuid), "%04x",
                      static_cast<unsigned>(readLittleEndian16(value)));
    } else if (width == 4U) {
        std::snprintf(uuid, sizeof(uuid), "%08lx",
                      static_cast<unsigned long>(readLittleEndian32(value)));
    } else if (width == 16U) {
        // Bluetooth transmits a 128-bit UUID least-significant octet first.
        std::snprintf(
            uuid, sizeof(uuid),
            "%02x%02x%02x%02x-%02x%02x-%02x%02x-%02x%02x-"
            "%02x%02x%02x%02x%02x%02x",
            value[15], value[14], value[13], value[12],
            value[11], value[10], value[9], value[8],
            value[7], value[6], value[5], value[4],
            value[3], value[2], value[1], value[0]);
    } else {
        return;
    }

    std::uint32_t hash = 2166136261UL;
    for (const char* character = uuid; *character != '\0'; ++character) {
        hash ^= static_cast<std::uint8_t>(*character);
        hash *= 16777619UL;
    }
    facts->firstServiceUuidHash = hash;
    const char* visible = uuid;
    char compact[7] = {};
    const std::size_t uuidLength = std::strlen(uuid);
    if (uuidLength > 10U) {
        std::snprintf(compact, sizeof(compact), "0x%.4s", uuid + 4);
        visible = compact;
    }
    const std::size_t visibleLength = std::min<std::size_t>(
        std::strlen(visible), facts->firstServiceUuid.size() - 1U);
    std::copy_n(visible, visibleLength, facts->firstServiceUuid.begin());
    facts->firstServiceUuid[visibleLength] = '\0';
    facts->firstServiceUuidLength =
        static_cast<std::uint8_t>(visibleLength);
}

