anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
void parseAdvertisementPayload(const RawAdvertisement& source,
                               const char** name,
                               std::size_t* nameLength,
                               AdvertisementFacts* facts) {
    if (name == nullptr || nameLength == nullptr || facts == nullptr) return;
    *name = nullptr;
    *nameLength = 0U;
    *facts = {};
    facts->present = true;
    facts->addressType = source.addressType;
    facts->advertisementType = source.eventType;
    facts->legacy = true;
    facts->scannable = source.eventType == 0U || source.eventType == 2U;
    facts->connectable = source.eventType == 0U || source.eventType == 1U;
    facts->payloadLength = source.payloadLength;

    UuidCandidates candidates;
    bool completeName = false;
    std::size_t offset = 0U;
    while (offset < source.payloadLength) {
        const std::uint8_t fieldLength = source.payload[offset++];
        if (fieldLength == 0U) break;
        if (fieldLength > source.payloadLength - offset) break;
        const std::uint8_t type = source.payload[offset];
        const std::uint8_t* data = source.payload.data() + offset + 1U;
        const std::size_t dataLength = fieldLength - 1U;

        switch (type) {
            case 0x08U:
            case 0x09U:
                if (dataLength != 0U &&
                    (!completeName || type == 0x09U)) {
                    *name = reinterpret_cast<const char*>(data);
                    *nameLength = std::min<std::size_t>(
                        dataLength,
                        domain::observations::Observation::kLabelCapacity);
                    completeName = type == 0x09U;
                }
                break;
            case 0x0aU:
                if (dataLength >= 1U) {
                    facts->txPowerKnown = true;
                    facts->txPowerDbm = static_cast<std::int8_t>(data[0]);
                }
                break;
            case 0x19U:
                if (dataLength >= 2U) {
                    facts->appearanceKnown = true;
                    facts->appearance = readLittleEndian16(data);
                }
                break;
            case 0xffU:
                facts->manufacturerDataLength = static_cast<std::uint8_t>(
                    std::min<std::size_t>(dataLength, UINT8_MAX));
                if (dataLength >= 2U) {
                    facts->companyKnown = true;
                    facts->companyId = readLittleEndian16(data);
                    if (facts->companyId == 0x004cU && dataLength >= 3U) {
                        facts->appleContinuityType = data[2];
                    }
                }
                break;
            case 0x02U:
            case 0x03U: {
                const std::size_t count = dataLength / 2U;
                facts->serviceUuidCount = saturatingAdd(
                    facts->serviceUuidCount, count);
                if (candidates.uuid16 == nullptr && count != 0U) {
                    candidates.uuid16 = data;
                }
                for (std::size_t index = 0U; index < count; ++index) {
                    facts->knownServiceMask |= serviceMask(
                        readLittleEndian16(data + index * 2U));
                }
                break;
            }
            case 0x04U:
            case 0x05U: {
                const std::size_t count = dataLength / 4U;
                facts->serviceUuidCount = saturatingAdd(
                    facts->serviceUuidCount, count);
                if (candidates.uuid32 == nullptr && count != 0U) {
                    candidates.uuid32 = data;
                }
                break;
            }
            case 0x06U:
            case 0x07U: {
                const std::size_t count = dataLength / 16U;
                facts->serviceUuidCount = saturatingAdd(
                    facts->serviceUuidCount, count);
                if (candidates.uuid128 == nullptr && count != 0U) {
                    candidates.uuid128 = data;
                }
                break;
            }
            case 0x16U:
                if (dataLength >= 2U) {
                    facts->serviceDataCount = saturatingAdd(
                        facts->serviceDataCount, 1U);
                    facts->serviceUuidCount = saturatingAdd(
                        facts->serviceUuidCount, 1U);
                    facts->knownServiceMask |= serviceMask(
                        readLittleEndian16(data));
                    if (candidates.service16 == nullptr) {
                        candidates.service16 = data;
                    }
                }
                break;
            case 0x20U:
                if (dataLength >= 4U) {
                    facts->serviceDataCount = saturatingAdd(
                        facts->serviceDataCount, 1U);
                    facts->serviceUuidCount = saturatingAdd(
                        facts->serviceUuidCount, 1U);
                    if (candidates.service32 == nullptr) {
                        candidates.service32 = data;
                    }
                }
                break;
            case 0x21U:
                if (dataLength >= 16U) {
                    facts->serviceDataCount = saturatingAdd(
                        facts->serviceDataCount, 1U);
                    facts->serviceUuidCount = saturatingAdd(
                        facts->serviceUuidCount, 1U);
                    if (candidates.service128 == nullptr) {
                        candidates.service128 = data;
                    }
                }
                break;
            default:
                break;
        }
        offset += fieldLength;
    }

    if (candidates.uuid16 != nullptr) {
        retainFirstServiceUuid(candidates.uuid16, 2U, facts);
    } else if (candidates.uuid32 != nullptr) {
        retainFirstServiceUuid(candidates.uuid32, 4U, facts);
    } else if (candidates.uuid128 != nullptr) {
        retainFirstServiceUuid(candidates.uuid128, 16U, facts);
    } else if (candidates.service16 != nullptr) {
        retainFirstServiceUuid(candidates.service16, 2U, facts);
    } else if (candidates.service32 != nullptr) {
        retainFirstServiceUuid(candidates.service32, 4U, facts);
    } else if (candidates.service128 != nullptr) {
        retainFirstServiceUuid(candidates.service128, 16U, facts);
    }
}

