anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
void clearReportQueue() {
    portENTER_CRITICAL(&nimbleObserver.lock);
    nimbleObserver.readIndex = 0U;
    nimbleObserver.writeIndex = 0U;
    nimbleObserver.queued = 0U;
    nimbleObserver.reportsObserved = 0U;
    nimbleObserver.queueDrops = 0U;
    portEXIT_CRITICAL(&nimbleObserver.lock);
}

bool popReport(RawAdvertisement* report) {
    if (report == nullptr) return false;
    bool available = false;
    portENTER_CRITICAL(&nimbleObserver.lock);
    if (nimbleObserver.queued != 0U) {
        *report = nimbleObserver.queue[nimbleObserver.readIndex];
        nimbleObserver.readIndex =
            (nimbleObserver.readIndex + 1U) %
            NimbleObserverState::kQueueCapacity;
        --nimbleObserver.queued;
        available = true;
    }
    portEXIT_CRITICAL(&nimbleObserver.lock);
    return available;
}

std::uint16_t takeQueueDrops() {
    portENTER_CRITICAL(&nimbleObserver.lock);
    const std::uint16_t drops = nimbleObserver.queueDrops;
    nimbleObserver.queueDrops = 0U;
    portEXIT_CRITICAL(&nimbleObserver.lock);
    return drops;
}

std::uint16_t takeReportsObserved() {
    portENTER_CRITICAL(&nimbleObserver.lock);
    const std::uint16_t observed = nimbleObserver.reportsObserved;
    nimbleObserver.reportsObserved = 0U;
    portEXIT_CRITICAL(&nimbleObserver.lock);
    return observed;
}

void queueReport(const RawAdvertisement& report) {
    portENTER_CRITICAL(&nimbleObserver.lock);
    if (nimbleObserver.acceptingReports) {
        if (nimbleObserver.reportsObserved != UINT16_MAX) {
            ++nimbleObserver.reportsObserved;
        }
        if (nimbleObserver.queued < NimbleObserverState::kQueueCapacity) {
            nimbleObserver.queue[nimbleObserver.writeIndex] = report;
            nimbleObserver.writeIndex =
                (nimbleObserver.writeIndex + 1U) %
                NimbleObserverState::kQueueCapacity;
            ++nimbleObserver.queued;
        } else if (nimbleObserver.queueDrops != UINT16_MAX) {
            ++nimbleObserver.queueDrops;
        }
    }
    portEXIT_CRITICAL(&nimbleObserver.lock);
}

std::uint16_t scanUnits(std::uint16_t milliseconds) {
    return static_cast<std::uint16_t>(
        (static_cast<std::uint32_t>(milliseconds) * 1000U) / 625U);
}

void setAcceptingReports(bool accepting) {
    portENTER_CRITICAL(&nimbleObserver.lock);
    nimbleObserver.acceptingReports = accepting;
    portEXIT_CRITICAL(&nimbleObserver.lock);
}

int handleNimbleGapEvent(struct ble_gap_event* event, void*) {
    if (event == nullptr || event->type != BLE_GAP_EVENT_DISC) return 0;
    const ble_gap_disc_desc& source = event->disc;
    RawAdvertisement report;
    report.addressType = source.addr.type;
    report.eventType = source.event_type;
    std::copy_n(source.addr.val, report.address.size(),
                report.address.begin());
    report.payloadLength = static_cast<std::uint8_t>(
        std::min<std::size_t>(source.length_data, report.payload.size()));
    if (source.data != nullptr && report.payloadLength != 0U) {
        std::copy_n(source.data, report.payloadLength,
                    report.payload.begin());
    }
    report.rssiDbm = source.rssi;
    queueReport(report);
    return 0;
}

bool startPassiveScan(const drivers::ble::BleScanPlan& plan) {
    ble_gap_disc_params parameters{};
    parameters.itvl = scanUnits(plan.intervalMs);
    parameters.window = scanUnits(plan.windowMs);
    parameters.filter_policy = 0U;
    parameters.limited = 0U;
    parameters.passive = 1U;  // passive scan: never transmit scan requests
    parameters.filter_duplicates = 0U;
    parameters.disable_observer_mode = 0U;
    return ble_gap_disc(
        processOwnAddressType.load(std::memory_order_acquire),
        BLE_HS_FOREVER, &parameters, handleNimbleGapEvent, nullptr) == 0;
}

bool stopPassiveScan() {
    const int result = ble_gap_disc_cancel();
    return result == 0 || result == BLE_HS_EALREADY;
}

std::uint64_t monotonicUs() {
    std::uint64_t value = static_cast<std::uint64_t>(esp_timer_get_time());
    return value == 0U ? 1U : value;
}

services::ble::BleGattUuid copyGattUuid(const ble_uuid_t* source) {
    services::ble::BleGattUuid result{};
    if (source == nullptr) return result;
    if (source->type == BLE_UUID_TYPE_16) {
        const std::uint16_t value = BLE_UUID16(source)->value;
        result.widthBytes = 2U;
        result.bytes[0] = static_cast<std::uint8_t>(value);
        result.bytes[1] = static_cast<std::uint8_t>(value >> 8U);
    } else if (source->type == BLE_UUID_TYPE_32) {
        const std::uint32_t value = BLE_UUID32(source)->value;
        result.widthBytes = 4U;
        for (std::size_t index = 0U; index < 4U; ++index) {
            result.bytes[index] = static_cast<std::uint8_t>(
                value >> (index * 8U));
        }
    } else if (source->type == BLE_UUID_TYPE_128) {
        result.widthBytes = 16U;
        std::copy_n(BLE_UUID128(source)->value, result.bytes.size(),
                    result.bytes.begin());
    }
    return result;
}

int handleGattGapEvent(struct ble_gap_event* event, void* context) {
    auto* transport = static_cast<BoardBleGattInspectorTransport*>(context);
    return transport == nullptr ? BLE_HS_EINVAL
                                : transport->handleGapEvent(event);
}

int handleGattServiceDiscovery(std::uint16_t connHandle,
                               const struct ble_gatt_error* error,
                               const struct ble_gatt_svc* service,
                               void* context) {
    auto* transport = static_cast<BoardBleGattInspectorTransport*>(context);
    return transport == nullptr
        ? BLE_HS_EINVAL
        : transport->handleServiceDiscovery(connHandle, error, service);
}

int handleGattCharacteristicDiscovery(
    std::uint16_t connHandle, const struct ble_gatt_error* error,
    const struct ble_gatt_chr* characteristic, void* context) {
    auto* transport = static_cast<BoardBleGattInspectorTransport*>(context);
    return transport == nullptr
        ? BLE_HS_EINVAL
        : transport->handleCharacteristicDiscovery(
              connHandle, error, characteristic);
}

void processAdvertisement(const RawAdvertisement& source,
                          RawScanContext* context) {
    if (context == nullptr || context->result == nullptr ||
        context->visitor == nullptr) {
        return;
    }
    std::array<std::uint8_t, 6> canonicalAddress{};
    std::reverse_copy(source.address.begin(), source.address.end(),
                      canonicalAddress.begin());
    if (context->deduplicateAddresses) {
        for (std::uint16_t index = 0; index < context->seenCount; ++index) {
            if (context->seenAddresses[index] == canonicalAddress) return;
        }
        if (context->seenCount >= context->seenAddresses.size()) {
            increment(&context->result->dropped);
            return;
        }
        context->seenAddresses[context->seenCount++] = canonicalAddress;
    }
    increment(&context->result->recordsReported);
    if (context->result->recordsRead >= context->maximumRecords) {
        increment(&context->result->dropped);
        return;
    }

    drivers::ble::BleAdvertisementRecord record;
    record.address = canonicalAddress;
    record.addressType = source.addressType;
    record.eventType = source.eventType;
    record.rssiDbm = source.rssiDbm;
    record.payloadLength = source.payloadLength;
    std::copy_n(source.payload.begin(), source.payloadLength,
                record.payload.begin());
    parseAdvertisementPayload(source, &record.name, &record.nameLength,
                              &record.advertisement);
    increment(&context->result->recordsRead);
    switch (context->visitor(
        record, static_cast<std::uint64_t>(esp_timer_get_time()),
        context->visitorContext)) {
        case BleRecordDisposition::Accepted:
            increment(&context->result->accepted);
            break;
        case BleRecordDisposition::Rejected:
            increment(&context->result->rejected);
            break;
        case BleRecordDisposition::Dropped:
            increment(&context->result->dropped);
            break;
    }
}

