anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
void drainReports(RawScanContext* context) {
    RawAdvertisement report;
    while (popReport(&report)) processAdvertisement(report, context);
    const std::uint16_t observed = takeReportsObserved();
    const std::uint16_t queueDrops = takeQueueDrops();
    if (context == nullptr || context->result == nullptr) return;
    for (std::uint16_t index = 0U; index < observed; ++index) {
        increment(&context->result->recordsObserved);
    }
    for (std::uint16_t index = 0U; index < queueDrops; ++index) {
        increment(&context->result->dropped);
    }
}

void handleNimbleReset(int reason) {
    processNimbleSyncError.store(reason, std::memory_order_release);
    processNimbleSynced = false;
    processControllerAvailable = false;
}

void handleNimbleSync() {
    // nimble_port_init() synchronizes the host transport, but it does not
    // establish an own address. The Arduino BLE wrapper used by the accepted
    // 0.156 HIL performs this step in BLEDevice::onSync(). Without it the GAP
    // discovery command can return success while the controller delivers no
    // advertising reports. Resolve the address before publishing readiness.
    std::uint8_t ownAddressType = BLE_OWN_ADDR_PUBLIC;
    const int ensured = ble_hs_util_ensure_addr(0);
    const int inferred = ensured == 0
        ? ble_hs_id_infer_auto(0, &ownAddressType)
        : ensured;
    if (inferred != 0) {
        processNimbleSyncError.store(inferred, std::memory_order_release);
        processControllerAvailable.store(false, std::memory_order_release);
        processNimbleSynced.store(false, std::memory_order_release);
        return;
    }
    processOwnAddressType.store(
        ownAddressType, std::memory_order_release);
    processNimbleSyncError.store(0, std::memory_order_release);
    processNimbleSynced.store(true, std::memory_order_release);
}

void runProcessNimbleHost(void*) {
    processNimbleHostRunning = true;
    nimble_port_run();
    processNimbleSynced = false;
    processControllerAvailable = false;
    // The FreeRTOS port deinitializer deletes the current host task and is not
    // required to return. Publish the exit path before handing it ownership.
    processNimbleHostRunning = false;
    nimble_port_freertos_deinit();
}

bool shutdownProcessControllerObserver() {
    setAcceptingReports(false);
    clearReportQueue();
    processControllerAvailable = false;
    processNimbleSynced = false;
    processOwnAddressType.store(
        BLE_OWN_ADDR_PUBLIC, std::memory_order_release);
    if (!processControllerInitialized) return true;

    const bool stopRequested = nimble_port_stop() == ESP_OK;
    const std::uint64_t deadlineUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) +
        static_cast<std::uint64_t>(
            BoardBlePassiveScanner::kHostShutdownTimeoutMs) * 1000ULL;
    while (processNimbleHostRunning &&
           static_cast<std::uint64_t>(esp_timer_get_time()) < deadlineUs) {
        vTaskDelay(pdMS_TO_TICKS(1U));
    }
    if (processNimbleHostRunning) return false;
    // Let the host task execute its immediate self-delete before deinitializing
    // the controller/host pools from this worker task on a different core.
    vTaskDelay(pdMS_TO_TICKS(1U));

    const bool deinitialized = nimble_port_deinit() == ESP_OK;
    if (deinitialized) processControllerInitialized = false;
    return stopRequested && deinitialized;
}

bool initializeProcessControllerObserver(
    BoardBleBeginDiagnostic* diagnostic) {
    if (processControllerInitialized) {
        const bool ready = processControllerAvailable && processNimbleSynced &&
            ble_hs_synced();
        if (diagnostic != nullptr) {
            diagnostic->stage = ready ? BoardBleBeginStage::ReusedReady
                                      : BoardBleBeginStage::HostSync;
            diagnostic->error = ready
                ? 0 : processNimbleSyncError.load(std::memory_order_acquire);
            if (!ready && diagnostic->error == 0) {
                diagnostic->error = ESP_ERR_INVALID_STATE;
            }
        }
        if (!ready) {
            const bool cleanupComplete = shutdownProcessControllerObserver();
            if (diagnostic != nullptr) {
                diagnostic->cleanupComplete = cleanupComplete;
            }
        }
        return ready;
    }
    clearReportQueue();
    setAcceptingReports(false);
    processNimbleSyncError.store(0, std::memory_order_release);

    // esp32-hal-alloc-ble-mem.h registers this low-level adapter as a BLE
    // consumer before initArduino(). Without that constructor marker the core
    // permanently releases BLE controller memory before setup(), and the
    // later NimBLE bootstrap enters an invalid controller lifecycle.
    // Arduino-ESP32 3.3.9 is built with NimBLE, not Bluedroid. The Arduino
    // controller-only shortcut enters a lifecycle that crashes on this S3;
    // nimble_port_init() is the framework's supported controller + transport
    // bootstrap. The complete host lifecycle is bounded by one Product Survey
    // run so FAT/SDSPI can mount before and after radio observation without
    // competing for the same internal heap. This adapter never calls
    // advertising, initiating, connecting or active-scan APIs, so no RF-TX operation
    // is reachable from the product observer.
    if (diagnostic != nullptr) {
        diagnostic->stage = BoardBleBeginStage::ControllerInit;
    }
    const int initError = nimble_port_init();
    if (initError != ESP_OK) {
        if (diagnostic != nullptr) diagnostic->error = initError;
        return false;
    }
    processControllerInitialized = true;

    ble_hs_cfg.reset_cb = handleNimbleReset;
    ble_hs_cfg.sync_cb = handleNimbleSync;
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;
    ble_hs_cfg.sm_bonding = 0U;
    ble_hs_cfg.sm_mitm = 0U;
    ble_hs_cfg.sm_sc = 0U;
    processNimbleSynced = false;
    processNimbleHostRunning = false;
    if (diagnostic != nullptr) {
        diagnostic->stage = BoardBleBeginStage::HostSync;
    }
    nimble_port_freertos_init(runProcessNimbleHost);

    const std::uint64_t deadlineUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) +
        static_cast<std::uint64_t>(kNimbleSyncTimeoutMs) * 1000ULL;
    while (!processNimbleSynced &&
           static_cast<std::uint64_t>(esp_timer_get_time()) < deadlineUs) {
        vTaskDelay(pdMS_TO_TICKS(1U));
    }
    if (!processNimbleSynced || !ble_hs_synced()) {
        int syncError =
            processNimbleSyncError.load(std::memory_order_acquire);
        if (syncError == 0) syncError = ESP_ERR_TIMEOUT;
        if (diagnostic != nullptr) diagnostic->error = syncError;
        const bool cleanupComplete = shutdownProcessControllerObserver();
        if (diagnostic != nullptr) {
            diagnostic->cleanupComplete = cleanupComplete;
        }
        return false;
    }
    processControllerAvailable = true;
    if (diagnostic != nullptr) {
        diagnostic->stage = BoardBleBeginStage::Ready;
        diagnostic->error = 0;
    }
    return true;
}

}  // namespace

