anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
volatile bool BoardBlePassiveScanner::activeScan_ = false;
std::atomic_bool BoardBlePassiveScanner::cancelRequested_{false};

const char* boardBleScanStatusName(BoardBleScanStatus status) {
    switch (status) {
        case BoardBleScanStatus::Valid: return "valid";
        case BoardBleScanStatus::NotStarted: return "not_started";
        case BoardBleScanStatus::InvalidPlan: return "invalid_plan";
        case BoardBleScanStatus::StackInitFailed: return "stack_init_failed";
        case BoardBleScanStatus::ScannerUnavailable:
            return "scanner_unavailable";
        case BoardBleScanStatus::ScanTimedOut: return "scan_timed_out";
    }
    return "unknown";
}

const char* boardBleBeginStageName(BoardBleBeginStage stage) {
    switch (stage) {
        case BoardBleBeginStage::NotAttempted: return "not_attempted";
        case BoardBleBeginStage::ReusedReady: return "reused_ready";
        case BoardBleBeginStage::ControllerInit: return "controller_init";
        case BoardBleBeginStage::HostSync: return "host_sync";
        case BoardBleBeginStage::Ready: return "ready";
    }
    return "unknown";
}

const char* boardBleGattHilFaultName(BoardBleGattHilFault fault) {
    switch (fault) {
        case BoardBleGattHilFault::None: return "none";
        case BoardBleGattHilFault::UnexpectedPeer:
            return "unexpected_peer";
        case BoardBleGattHilFault::Timeout: return "timeout";
        case BoardBleGattHilFault::ResourceConflict:
            return "resource_conflict";
        case BoardBleGattHilFault::DisconnectFailure:
            return "disconnect_failure";
    }
    return "none";
}

bool BoardBlePassiveScanner::begin() {
    beginDiagnostic_ = {};
    beginDiagnostic_.heapFreeBefore = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    beginDiagnostic_.heapLargestBefore = static_cast<std::uint32_t>(
        heap_caps_get_largest_free_block(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if (initialized_) {
        beginDiagnostic_.stage = BoardBleBeginStage::ReusedReady;
        beginDiagnostic_.heapFreeAfter = beginDiagnostic_.heapFreeBefore;
        beginDiagnostic_.heapLargestAfter = beginDiagnostic_.heapLargestBefore;
        beginDiagnostic_.cleanupComplete = false;
        return true;
    }
    cancelRequested_.store(false, std::memory_order_release);
    cleanupComplete_ = false;
    passiveOnly_ = true;
    clearReportQueue();
    setAcceptingReports(false);

    // Storage admission and its FAT mount have already completed and released
    // their heap. Only passive ble_gap_disc() is exposed by this adapter; no
    // advertising, initiating, connecting or active scanning is representable.
    const bool ready = initializeProcessControllerObserver(&beginDiagnostic_);
    beginDiagnostic_.heapFreeAfter = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    beginDiagnostic_.heapLargestAfter = static_cast<std::uint32_t>(
        heap_caps_get_largest_free_block(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if (!ready) {
        cleanupComplete_ = beginDiagnostic_.cleanupComplete;
        return false;
    }
    initialized_ = true;
    beginDiagnostic_.cleanupComplete = false;
    return true;
}

BoardBlePassiveScanResult BoardBlePassiveScanner::scan(
    const drivers::ble::BleScanPlan& plan,
    BleRecordVisitor visitor, void* context) {
    BoardBlePassiveScanResult result;
    if (!initialized_) return result;
    if (!drivers::ble::validatePassivePlan(plan) || visitor == nullptr) {
        result.status = BoardBleScanStatus::InvalidPlan;
        return result;
    }

    RawScanContext scanContext;
    scanContext.maximumRecords = plan.maximumRecords;
    scanContext.deduplicateAddresses = plan.deduplicateAddresses;
    scanContext.visitor = visitor;
    scanContext.visitorContext = context;
    scanContext.result = &result;
    const std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    for (std::uint16_t attempt = 1U;
         attempt <= kMaximumScanAttempts; ++attempt) {
        result.attempts = attempt;
        if (cancelRequested_.load(std::memory_order_acquire)) {
            result.status = BoardBleScanStatus::ScanTimedOut;
            break;
        }
        clearReportQueue();
        setAcceptingReports(true);
        const bool started = startPassiveScan(plan);
        if (!started) {
            setAcceptingReports(false);
            activeScan_ = false;
            result.status = BoardBleScanStatus::ScannerUnavailable;
        } else {
            activeScan_ = true;
            const std::uint64_t deadlineUs =
                static_cast<std::uint64_t>(esp_timer_get_time()) +
                static_cast<std::uint64_t>(plan.durationMs) * 1000ULL;
            while (activeScan_ &&
                   !cancelRequested_.load(std::memory_order_acquire) &&
                   static_cast<std::uint64_t>(esp_timer_get_time()) <
                       deadlineUs) {
                drainReports(&scanContext);
                vTaskDelay(pdMS_TO_TICKS(5U));
            }
            drainReports(&scanContext);
            const bool completedWindow = activeScan_;
            const bool disabled = completedWindow ? stopPassiveScan() : true;
            activeScan_ = false;
            setAcceptingReports(false);
            drainReports(&scanContext);
            result.status = completedWindow && disabled &&
                    !cancelRequested_.load(std::memory_order_acquire)
                ? BoardBleScanStatus::Valid
                : BoardBleScanStatus::ScanTimedOut;
        }
        if (result.valid() || attempt == kMaximumScanAttempts) break;
        if (result.status != BoardBleScanStatus::ScannerUnavailable &&
            result.status != BoardBleScanStatus::ScanTimedOut) {
            break;
        }
        increment(&result.transientRetries);
        vTaskDelay(pdMS_TO_TICKS(kRetryDelayMs));
    }
    result.durationUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - startedUs;
    return result;
}

bool BoardBlePassiveScanner::cancelActiveScan() {
    cancelRequested_.store(true, std::memory_order_release);
    if (!activeScan_) return true;
    const bool cancelled = stopPassiveScan();
    activeScan_ = false;
    setAcceptingReports(false);
    return cancelled;
}

bool BoardBlePassiveScanner::processControllerReady() {
    return processControllerAvailable && processNimbleSynced &&
        ble_hs_synced();
}

bool BoardBlePassiveScanner::end() {
    bool complete = cancelActiveScan();
    initialized_ = false;
    activeScan_ = false;
    complete = shutdownProcessControllerObserver() && complete;
    cleanupComplete_ = complete && !processControllerReady() &&
        !processNimbleHostRunning && !processControllerInitialized;
    beginDiagnostic_.cleanupComplete = cleanupComplete_;
    return cleanupComplete_;
}

bool BoardBleGattInspectorTransport::bind(
    services::ble::BleGattInspector* inspector) {
    if (inspector == nullptr) return false;
    GattInspectorLock gattLock;
    const bool available = inspector_ == nullptr && !hostReady_ &&
        !connecting_.load(std::memory_order_acquire) &&
        !connected_.load(std::memory_order_acquire);
    if (available) inspector_ = inspector;

    return available;
}

bool BoardBleGattInspectorTransport::unbind() {
    GattInspectorLock gattLock;
    const bool clean = inspector_ != nullptr &&
        inspector_->cleanupComplete() && !hostReady_ &&
        !connecting_.load(std::memory_order_acquire) &&
        !connected_.load(std::memory_order_acquire);
    if (clean) inspector_ = nullptr;

    return clean;
}

bool BoardBleGattInspectorTransport::selectTarget(
    const services::ble::BleInspectorTarget& target,
    std::uint64_t nowMonotonicUs) {
    GattInspectorLock gattLock;
    const bool selected = inspector_ != nullptr &&
        inspector_->selectTarget(target, nowMonotonicUs);

    return selected;
}

