anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
bool BoardBleGattInspectorTransport::reviewPermission(
    services::ble::BleGattInspectorPermission permission) {
    GattInspectorLock gattLock;
    const bool reviewed = inspector_ != nullptr &&
        inspector_->reviewPermission(permission);

    return reviewed;
}

std::uint64_t BoardBleGattInspectorTransport::confirmationToken() const {
    GattInspectorLock gattLock;
    const std::uint64_t token = inspector_ == nullptr
        ? 0U : inspector_->confirmationToken();

    return token;
}

bool BoardBleGattInspectorTransport::confirm(
    std::uint64_t token, std::uint64_t nowMonotonicUs) {
    GattInspectorLock gattLock;
    const bool confirmed = inspector_ != nullptr &&
        inspector_->confirm(token, nowMonotonicUs);

    return confirmed;
}

bool BoardBleGattInspectorTransport::back(std::uint64_t nowMonotonicUs) {
    GattInspectorLock gattLock;
    const bool changed = inspector_ != nullptr &&
        inspector_->back(nowMonotonicUs);

    return changed;
}

bool BoardBleGattInspectorTransport::tick(std::uint64_t nowMonotonicUs) {
    GattInspectorLock gattLock;
    const bool changed = inspector_ != nullptr &&
        inspector_->tick(nowMonotonicUs);

    updateHeapMinimum();
    return changed;
}

services::ble::BleGattInspectorState
BoardBleGattInspectorTransport::state() const {
    GattInspectorLock gattLock;
    const auto value = inspector_ == nullptr
        ? services::ble::BleGattInspectorState::Idle : inspector_->state();

    return value;
}

services::ble::BleGattInspectorFailure
BoardBleGattInspectorTransport::failure() const {
    GattInspectorLock gattLock;
    const auto value = inspector_ == nullptr
        ? services::ble::BleGattInspectorFailure::None
        : inspector_->failure();

    return value;
}

services::ble::BleGattInspectorFailure
BoardBleGattInspectorTransport::cleanupCause() const {
    GattInspectorLock gattLock;
    const auto value = inspector_ == nullptr
        ? services::ble::BleGattInspectorFailure::None
        : inspector_->cleanupCause();

    return value;
}

std::size_t BoardBleGattInspectorTransport::serviceCount() const {
    GattInspectorLock gattLock;
    const std::size_t value = inspector_ == nullptr
        ? 0U : inspector_->serviceCount();

    return value;
}

std::size_t BoardBleGattInspectorTransport::characteristicCount() const {
    GattInspectorLock gattLock;
    const std::size_t value = inspector_ == nullptr
        ? 0U : inspector_->characteristicCount();

    return value;
}

bool BoardBleGattInspectorTransport::copyService(
    std::size_t index, services::ble::BleGattServiceFact* output) const {
    if (output == nullptr) return false;
    GattInspectorLock gattLock;
    const auto* source = inspector_ == nullptr
        ? nullptr : inspector_->serviceAt(index);
    if (source != nullptr) *output = *source;

    return source != nullptr;
}

bool BoardBleGattInspectorTransport::copyCharacteristic(
    std::size_t index,
    services::ble::BleGattCharacteristicFact* output) const {
    if (output == nullptr) return false;
    GattInspectorLock gattLock;
    const auto* source = inspector_ == nullptr
        ? nullptr : inspector_->characteristicAt(index);
    if (source != nullptr) *output = *source;

    return source != nullptr;
}

bool BoardBleGattInspectorTransport::copyTarget(
    services::ble::BleInspectorTarget* output) const {
    if (output == nullptr) return false;
    GattInspectorLock gattLock;
    const bool available = inspector_ != nullptr &&
        services::ble::validBleInspectorTarget(inspector_->target());
    if (available) *output = inspector_->target();

    return available;
}

bool BoardBleGattInspectorTransport::cleanupComplete() const {
    GattInspectorLock gattLock;
    const bool clean = inspector_ == nullptr || inspector_->cleanupComplete();

    return clean && !hostReady_ &&
        !connecting_.load(std::memory_order_acquire) &&
        !connected_.load(std::memory_order_acquire);
}

bool BoardBleGattInspectorTransport::ownsRadio() const {
    GattInspectorLock gattLock;
    const bool owned = inspector_ != nullptr && inspector_->ownsRadio();

    return owned;
}

bool BoardBleGattInspectorTransport::hostReady() const {
    return hostReady_ && BoardBlePassiveScanner::processControllerReady();
}

bool BoardBleGattInspectorTransport::connected() const {
    return connected_.load(std::memory_order_acquire);
}

bool BoardBleGattInspectorTransport::armHilFault(
    BoardBleGattHilFault fault) {
    if (fault == BoardBleGattHilFault::None) return false;
    std::uint8_t expected =
        static_cast<std::uint8_t>(BoardBleGattHilFault::None);
    return armedHilFault_.compare_exchange_strong(
        expected, static_cast<std::uint8_t>(fault),
        std::memory_order_acq_rel, std::memory_order_acquire);
}

void BoardBleGattInspectorTransport::clearHilFault() {
    armedHilFault_.store(
        static_cast<std::uint8_t>(BoardBleGattHilFault::None),
        std::memory_order_release);
    lastConsumedHilFault_.store(
        static_cast<std::uint8_t>(BoardBleGattHilFault::None),
        std::memory_order_release);
}

bool BoardBleGattInspectorTransport::consumeHilFault(
    BoardBleGattHilFault fault) {
    if (fault == BoardBleGattHilFault::None) return false;
    std::uint8_t expected = static_cast<std::uint8_t>(fault);
    if (!armedHilFault_.compare_exchange_strong(
            expected, static_cast<std::uint8_t>(BoardBleGattHilFault::None),
            std::memory_order_acq_rel, std::memory_order_acquire)) {
        return false;
    }
    lastConsumedHilFault_.store(static_cast<std::uint8_t>(fault),
                                std::memory_order_release);
    hilFaultConsumedCount_.fetch_add(1U, std::memory_order_acq_rel);
    return true;
}

BoardBleGattHilFault BoardBleGattInspectorTransport::armedHilFault() const {
    return static_cast<BoardBleGattHilFault>(
        armedHilFault_.load(std::memory_order_acquire));
}

BoardBleGattHilFault
BoardBleGattInspectorTransport::lastConsumedHilFault() const {
    return static_cast<BoardBleGattHilFault>(
        lastConsumedHilFault_.load(std::memory_order_acquire));
}

