anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
std::uint32_t
BoardBleGattInspectorTransport::hilFaultConsumedCount() const {
    return hilFaultConsumedCount_.load(std::memory_order_acquire);
}

bool BoardBleGattInspectorTransport::startConnect(
    const services::ble::BleInspectorTarget& target) {
    if (hostReady_ || connecting_.load(std::memory_order_acquire) ||
        connected_.load(std::memory_order_acquire)) {
        return false;
    }
    heapFreeBefore_ = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    heapLargestBefore_ = static_cast<std::uint32_t>(
        heap_caps_get_largest_free_block(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    heapMinimum_ = heapFreeBefore_;
    BoardBleBeginDiagnostic diagnostic{};
    if (!initializeProcessControllerObserver(&diagnostic)) return false;
    hostReady_ = true;
    heapFreeAfterInit_ = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    heapLargestAfterInit_ = static_cast<std::uint32_t>(
        heap_caps_get_largest_free_block(
            MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    updateHeapMinimum();

    ble_addr_t peer{};
    peer.type = target.addressType;
    std::reverse_copy(target.address.begin(), target.address.end(), peer.val);
    target_ = target;
    connectionHandle_ = BLE_HS_CONN_HANDLE_NONE;
    characteristicServiceIndex_ = 0U;
    disconnected_.store(false, std::memory_order_release);
    remoteDisconnectPending_.store(false, std::memory_order_release);
    cleanupRequested_.store(false, std::memory_order_release);
    connecting_.store(true, std::memory_order_release);
    const int started = ble_gap_connect(
        processOwnAddressType.load(std::memory_order_acquire), &peer,
        static_cast<std::int32_t>(kConnectTimeoutMs), nullptr,
        handleGattGapEvent, this);
    if (started == 0) return true;
    connecting_.store(false, std::memory_order_release);
    disconnected_.store(true, std::memory_order_release);
    cleanupRequested_.store(true, std::memory_order_release);
    hostReady_ = !shutdownProcessControllerObserver();
    if (!hostReady_) {
        cleanupRequested_.store(false, std::memory_order_release);
        return false;
    }
    // The host exists but could not be torn down synchronously. Keep the
    // controller's radio lease and report the transport error on service();
    // the ordinary fail-closed disconnect path will retry teardown before the
    // lease can be released.
    remoteDisconnectPending_.store(true, std::memory_order_release);
    return true;
}

bool BoardBleGattInspectorTransport::startServiceDiscovery() {
    if (!hostReady_ || !connected_.load(std::memory_order_acquire) ||
        connectionHandle_ == BLE_HS_CONN_HANDLE_NONE) {
        return false;
    }
    characteristicServiceIndex_ = 0U;
    return ble_gattc_disc_all_svcs(
        connectionHandle_, handleGattServiceDiscovery, this) == 0;
}

services::ble::BleGattDisconnectStatus
BoardBleGattInspectorTransport::requestDisconnect() {
    cleanupRequested_.store(true, std::memory_order_release);
    if (connecting_.load(std::memory_order_acquire)) {
        const int result = ble_gap_conn_cancel();
        const bool accepted = result == 0 || result == BLE_HS_EALREADY;
        if (accepted && consumeHilFault(
                BoardBleGattHilFault::DisconnectFailure)) {
            return services::ble::BleGattDisconnectStatus::Failed;
        }
        return accepted ? services::ble::BleGattDisconnectStatus::Pending
                        : services::ble::BleGattDisconnectStatus::Failed;
    }
    if (connected_.load(std::memory_order_acquire) &&
        connectionHandle_ != BLE_HS_CONN_HANDLE_NONE) {
        const int result = ble_gap_terminate(
            connectionHandle_, BLE_ERR_REM_USER_CONN_TERM);
        const bool accepted = result == 0 || result == BLE_HS_ENOTCONN;
        if (accepted && consumeHilFault(
                BoardBleGattHilFault::DisconnectFailure)) {
            return services::ble::BleGattDisconnectStatus::Failed;
        }
        return accepted ? services::ble::BleGattDisconnectStatus::Pending
                        : services::ble::BleGattDisconnectStatus::Failed;
    }
    return hostReady_ ? services::ble::BleGattDisconnectStatus::Pending
                      : services::ble::BleGattDisconnectStatus::Disconnected;
}

services::ble::BleGattDisconnectStatus
BoardBleGattInspectorTransport::pollDisconnect() {
    if (connecting_.load(std::memory_order_acquire) ||
        connected_.load(std::memory_order_acquire)) {
        return services::ble::BleGattDisconnectStatus::Pending;
    }
    if (!hostReady_) {
        return services::ble::BleGattDisconnectStatus::Disconnected;
    }
    if (!cleanupRequested_.load(std::memory_order_acquire) ||
        !disconnected_.load(std::memory_order_acquire)) {
        return services::ble::BleGattDisconnectStatus::Pending;
    }
    const bool shutdown = shutdownProcessControllerObserver();
    if (!shutdown) return services::ble::BleGattDisconnectStatus::Failed;
    hostReady_ = false;
    connectionHandle_ = BLE_HS_CONN_HANDLE_NONE;
    cleanupRequested_.store(false, std::memory_order_release);
    updateHeapMinimum();
    return services::ble::BleGattDisconnectStatus::Disconnected;
}

bool BoardBleGattInspectorTransport::service(std::uint64_t nowMonotonicUs) {
    bool changed = false;
    if (remoteDisconnectPending_.exchange(false,
                                          std::memory_order_acq_rel)) {
        GattInspectorLock gattLock;
        if (inspector_ != nullptr &&
            inspector_->state() != services::ble::BleGattInspectorState::
                                      CleanupPending) {
            changed = inspector_->onTransportError(nowMonotonicUs);
        }

    }
    {
        GattInspectorLock gattLock;
        if (inspector_ != nullptr &&
            (inspector_->state() ==
                 services::ble::BleGattInspectorState::Connecting ||
             inspector_->state() ==
                 services::ble::BleGattInspectorState::Discovering) &&
            consumeHilFault(BoardBleGattHilFault::Timeout)) {
            const std::uint64_t injectedNowUs =
                nowMonotonicUs <=
                    UINT64_MAX -
                        services::ble::BleGattInspector::
                            kConnectedSessionTimeoutUs
                ? nowMonotonicUs +
                    services::ble::BleGattInspector::
                        kConnectedSessionTimeoutUs
                : UINT64_MAX;
            changed = inspector_->tick(injectedNowUs) || changed;
        }
    }
    changed = tick(nowMonotonicUs) || changed;
    return changed;
}

int BoardBleGattInspectorTransport::handleGapEvent(void* rawEvent) {
    auto* event = static_cast<ble_gap_event*>(rawEvent);
    if (event == nullptr) return 0;
    if (event->type == BLE_GAP_EVENT_CONNECT) {
        connecting_.store(false, std::memory_order_release);
        if (event->connect.status != 0) {
            disconnected_.store(true, std::memory_order_release);
            cleanupRequested_.store(true, std::memory_order_release);
            GattInspectorLock gattLock;
            if (inspector_ != nullptr) {
                (void)inspector_->onConnectionRefused(monotonicUs());
            }

