anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
            return 0;
        }
        connectionHandle_ = event->connect.conn_handle;
        connected_.store(true, std::memory_order_release);
        disconnected_.store(false, std::memory_order_release);
        std::array<std::uint8_t, 6> address{};
        std::uint8_t addressType = target_.addressType;
        ble_gap_conn_desc description{};
        if (ble_gap_conn_find(connectionHandle_, &description) == 0) {
            std::reverse_copy(description.peer_id_addr.val,
                              description.peer_id_addr.val + 6U,
                              address.begin());
            addressType = description.peer_id_addr.type;
        }
        const bool injectUnexpectedPeer = consumeHilFault(
            BoardBleGattHilFault::UnexpectedPeer);
        if (injectUnexpectedPeer) address[0] ^= 1U;
        GattInspectorLock gattLock;
        if (inspector_ != nullptr) {
            (void)inspector_->onConnected(
                address, addressType, monotonicUs());
        }

        updateHeapMinimum();
        return 0;
    }
    if (event->type == BLE_GAP_EVENT_DISCONNECT) {
        connecting_.store(false, std::memory_order_release);
        connected_.store(false, std::memory_order_release);
        disconnected_.store(true, std::memory_order_release);
        cleanupRequested_.store(true, std::memory_order_release);
        connectionHandle_ = BLE_HS_CONN_HANDLE_NONE;
        GattInspectorLock gattLock;
        const bool cleanupPending = inspector_ != nullptr &&
            inspector_->state() ==
                services::ble::BleGattInspectorState::CleanupPending;

        if (!cleanupPending) {
            remoteDisconnectPending_.store(true, std::memory_order_release);
        }
        return 0;
    }
    return 0;
}

int BoardBleGattInspectorTransport::handleServiceDiscovery(
    std::uint16_t connHandle, const void* rawError, const void* rawService) {
    const auto* error = static_cast<const ble_gatt_error*>(rawError);
    const auto* service = static_cast<const ble_gatt_svc*>(rawService);
    GattInspectorLock gattLock;
    if (inspector_ == nullptr || connHandle != connectionHandle_ ||
        error == nullptr) {

        return BLE_HS_EINVAL;
    }
    const std::uint64_t nowUs = monotonicUs();
    if (error->status == 0 && service != nullptr) {
        services::ble::BleGattServiceFact fact{};
        fact.startHandle = service->start_handle;
        fact.endHandle = service->end_handle;
        fact.uuid = copyGattUuid(&service->uuid.u);
        const bool accepted = inspector_->recordService(fact, nowUs);

        updateHeapMinimum();
        return accepted ? 0 : BLE_HS_EAPP;
    }
    if (error->status == BLE_HS_EDONE) {
        characteristicServiceIndex_ = 0U;

        const bool started = startNextCharacteristicDiscovery(nowUs);
        updateHeapMinimum();
        return started ? 0 : BLE_HS_EAPP;
    }
    (void)inspector_->onTransportError(nowUs);

    return BLE_HS_EAPP;
}

bool BoardBleGattInspectorTransport::startNextCharacteristicDiscovery(
    std::uint64_t nowMonotonicUs) {
    services::ble::BleGattServiceFact service{};
    std::uint16_t connectionHandle = BLE_HS_CONN_HANDLE_NONE;
    bool discoveryComplete = false;
    bool servicePresent = false;
    GattInspectorLock gattLock;
    if (inspector_ == nullptr) {

        return false;
    }
    if (characteristicServiceIndex_ >= inspector_->serviceCount()) {
        discoveryComplete = inspector_->onDiscoveryComplete(nowMonotonicUs);

        return discoveryComplete;
    }
    const auto* source = inspector_->serviceAt(characteristicServiceIndex_);
    servicePresent = source != nullptr;
    if (servicePresent) service = *source;
    connectionHandle = connectionHandle_;

    return servicePresent && connectionHandle != BLE_HS_CONN_HANDLE_NONE &&
        ble_gattc_disc_all_chrs(
        connectionHandle, service.startHandle, service.endHandle,
        handleGattCharacteristicDiscovery, this) == 0;
}

int BoardBleGattInspectorTransport::handleCharacteristicDiscovery(
    std::uint16_t connHandle, const void* rawError,
    const void* rawCharacteristic) {
    const auto* error = static_cast<const ble_gatt_error*>(rawError);
    const auto* characteristic =
        static_cast<const ble_gatt_chr*>(rawCharacteristic);
    GattInspectorLock gattLock;
    if (inspector_ == nullptr || connHandle != connectionHandle_ ||
        error == nullptr) {

        return BLE_HS_EINVAL;
    }
    const std::uint64_t nowUs = monotonicUs();
    if (error->status == 0 && characteristic != nullptr) {
        const auto* service = inspector_->serviceAt(
            characteristicServiceIndex_);
        services::ble::BleGattCharacteristicFact fact{};
        if (service != nullptr) {
            fact.serviceStartHandle = service->startHandle;
        }
        fact.declarationHandle = characteristic->def_handle;
        fact.valueHandle = characteristic->val_handle;
        fact.properties = characteristic->properties;
        fact.uuid = copyGattUuid(&characteristic->uuid.u);
        const bool accepted = inspector_->recordCharacteristic(fact, nowUs);

        updateHeapMinimum();
        return accepted ? 0 : BLE_HS_EAPP;
    }
    if (error->status == BLE_HS_EDONE) {
        ++characteristicServiceIndex_;

        const bool started = startNextCharacteristicDiscovery(nowUs);
        updateHeapMinimum();
        return started ? 0 : BLE_HS_EAPP;
    }
    (void)inspector_->onTransportError(nowUs);

    return BLE_HS_EAPP;
}

void BoardBleGattInspectorTransport::updateHeapMinimum() {
    const std::uint32_t free = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if (free < heapMinimum_) heapMinimum_ = free;
}

}  // namespace leshy1::platform::arduino
